In [1]:
import pandas as pd
import numpy as np

In [30]:
# Creazione di una series a partire da una lista
series = pd.Series([1,2,3,4,5,6,7])


series.describe()

count    7.000000
mean     4.000000
std      2.160247
min      1.000000
25%      2.500000
50%      4.000000
75%      5.500000
max      7.000000
dtype: float64

In [31]:
# Creazione di un dataframe a partire da una lista di liste
df = pd.DataFrame([[0,1],[0,1],[0,1]], columns=['apples','bananas'])
df.describe()

       apples  bananas
count     3.0      3.0
mean      0.0      1.0
std       0.0      0.0
min       0.0      1.0
25%       0.0      1.0
50%       0.0      1.0
75%       0.0      1.0
max       0.0      1.0

# Caricamento di un dataframe da csv

In [4]:
dataframe = pd.read_csv('adult_training.csv')

## Esplorazione dati

In [5]:
# Visualizza le prime n righe del dataframe
dataframe.head(5)

,age,work_class,education,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,39,State-gov,Bachelors,Never-Married,Admin,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,Bachelors,Married,White-Collar,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,High School grad,Separated,Blue-Collar,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,Dropout,Married,Blue-Collar,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,Bachelors,Married,Professional,Wife,Black,Female,0,0,40,Other,<=50K

In [6]:
# Ottieni la dimensione dal dataframe
dataframe.shape

(30162, 13)

In [7]:
# Informazioni generiche sulle varie colonne
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30162 entries, 0 to 30161
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             30162 non-null  int64
 1   work_class      30162 non-null  object
 2   education       30162 non-null  object
 3   marital_status  30162 non-null  object
 4   occupation      30162 non-null  object
 5   relationship    30162 non-null  object
 6   race            30162 non-null  object
 7   sex             30162 non-null  object
 8   capital_gain    30162 non-null  int64
 9   capital_loss    30162 non-null  int64
 10  hours_per_week  30162 non-null  int64
 11  native_country  30162 non-null  object
 12  income          30162 non-null  object
dtypes: int64(4), object(9)
memory usage: 3.0+ MB

In [8]:
# Elenca colonne del dataframe
print(dataframe.columns)

# Accesso a singola colonna
print(dataframe['age'])
print(dataframe['age'].describe())

Index(['age', 'work_class', 'education', 'marital_status', 'occupation',
       'relationship', 'race', 'sex', 'capital_gain', 'capital_loss',
       'hours_per_week', 'native_country', 'income'],
      dtype='object')
0        39
1        50
2        38
3        53
4        28
         ..
30157    27
30158    40
30159    58
30160    22
30161    52
Name: age, Length: 30162, dtype: int64
count    30162.000000
mean        38.437902
std         13.134665
min         17.000000
25%         28.000000
50%         37.000000
75%         47.000000
max         90.000000
Name: age, dtype: float64

In [9]:
# Conta etichette categoriche
print('unique labels', dataframe['relationship'].unique())
print('label counts', dataframe['relationship'].value_counts())

unique labels ['Not-in-family' 'Husband' 'Wife' 'Own-child' 'Unmarried' 'Other-relative']
label counts Husband           12463
Not-in-family      7726
Own-child          4466
Unmarried          3212
Wife               1406
Other-relative      889
Name: relationship, dtype: int64

# Definizione di un indice personalizzato

In [34]:

index = ['individuo_'+str(i) for i in range(dataframe.shape[0])]
dataframe.index = index

In [35]:
dataframe.head()

,age,work_class,education,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income,nuova_feature1,nuova_feature2
individuo_0,39,State-gov,Bachelors,Never-Married,Admin,Not-in-family,White,Male,2174,0,40,United-States,<=50K,2174,True
individuo_1,50,Self-emp-not-inc,Bachelors,Married,White-Collar,Husband,White,Male,0,0,13,United-States,<=50K,0,False
individuo_2,38,Private,High School grad,Separated,Blue-Collar,Not-in-family,White,Male,0,0,40,United-States,<=50K,0,False
individuo_3,53,Private,Dropout,Married,Blue-Collar,Husband,Black,Male,0,0,40,United-States,<=50K,0,False
individuo_4,28,Private,Bachelors,Married,Professional,Wife,Black,Female,0,0,40,Other,<=50K,0,False

In [36]:
# Accesso a dataframe usando .loc e .iloc

dataframe.loc['individuo_0']

age                          39
work_class            State-gov
education             Bachelors
marital_status    Never-Married
occupation                Admin
relationship      Not-in-family
race                      White
sex                        Male
capital_gain               2174
capital_loss                  0
hours_per_week               40
native_country    United-States
income                    <=50K
nuova_feature1             2174
nuova_feature2             True
Name: individuo_0, dtype: object

In [37]:
dataframe.iloc[0]

age                          39
work_class            State-gov
education             Bachelors
marital_status    Never-Married
occupation                Admin
relationship      Not-in-family
race                      White
sex                        Male
capital_gain               2174
capital_loss                  0
hours_per_week               40
native_country    United-States
income                    <=50K
nuova_feature1             2174
nuova_feature2             True
Name: individuo_0, dtype: object

In [38]:
# Conversione dataframe in numpy array
np_array=dataframe.values

In [39]:
np_array[:,0].mean()

38.437901995888865

# Queries sul dataframe

In [40]:
# Mostra etichette esistenti all'interno della colonna education
print(dataframe['education'].unique())

['Bachelors' 'High School grad' 'Dropout' 'Masters' 'Associates'
 'Doctorate' 'Prof-School']

In [45]:
# Query, seleziona individui con education=10th grade 
dataframe[dataframe['education']=='Bachelors'].head()

,age,work_class,education,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income,nuova_feature1,nuova_feature2
individuo_0,39,State-gov,Bachelors,Never-Married,Admin,Not-in-family,White,Male,2174,0,40,United-States,<=50K,2174,True
individuo_1,50,Self-emp-not-inc,Bachelors,Married,White-Collar,Husband,White,Male,0,0,13,United-States,<=50K,0,False
individuo_4,28,Private,Bachelors,Married,Professional,Wife,Black,Female,0,0,40,Other,<=50K,0,False
individuo_9,42,Private,Bachelors,Married,White-Collar,Husband,White,Male,5178,0,40,United-States,>50K,5178,True
individuo_11,30,State-gov,Bachelors,Married,Professional,Husband,Asian-Pac-Islander,Male,0,0,40,British-Commonwealth,>50K,0,False

In [46]:
# Mostra distribuzione percentuale di occupazione per individui risultanti da query
print(dataframe[dataframe['education']=='Bachelors']['occupation'].value_counts()/dataframe[dataframe['education']=='Bachelors'].shape[0])

Professional    0.289651
White-Collar    0.264274
Sales           0.157216
Admin           0.098731
Blue-Collar     0.090999
Other           0.064036
Service         0.034893
Military        0.000198
Name: occupation, dtype: float64

In [47]:
# Nuova query: uguale a prima ma con education = Masters
print(dataframe[dataframe['education']=='Masters']['occupation'].value_counts()/dataframe[dataframe['education']=='Masters'].shape[0])

Professional    0.503380
White-Collar    0.301782
Sales           0.079287
Admin           0.041180
Blue-Collar     0.032575
Other           0.030117
Service         0.011063
Military        0.000615
Name: occupation, dtype: float64

In [48]:
# Una query piu' complicata, vediamo quali sono le occupazioni piu' comuni per donne in possesso di master
print(dataframe[(dataframe['education']=='Masters') & (dataframe['sex']=='Female')]['occupation'].value_counts()/dataframe[dataframe['education']=='Masters'].shape[0])

# Qui lo stesso ma per gli uomini
print(dataframe[(dataframe['education']=='Masters') & (dataframe['sex']=='Male')]['occupation'].value_counts()/dataframe[dataframe['education']=='Masters'].shape[0])

Professional    0.203442
White-Collar    0.064536
Admin           0.017824
Sales           0.012907
Service         0.007376
Other           0.004302
Blue-Collar     0.002459
Name: occupation, dtype: float64
Professional    0.299939
White-Collar    0.237246
Sales           0.066380
Blue-Collar     0.030117
Other           0.025814
Admin           0.023356
Service         0.003688
Military        0.000615
Name: occupation, dtype: float64

## Esempi di data cleaning e processing

In [49]:
# Creazione di una nuova colonna come somma di due colonne esistenti

dataframe['nuova_feature1']=dataframe['capital_gain']-dataframe['capital_loss']

In [50]:
dataframe['nuova_feature1'].describe()

count    30162.000000
mean      1003.635369
std       7430.372730
min      -4356.000000
25%          0.000000
50%          0.000000
75%          0.000000
max      99999.000000
Name: nuova_feature1, dtype: float64

In [51]:
dataframe['nuova_feature2'] = dataframe['nuova_feature1'].apply(lambda x: x>0)

In [52]:
dataframe['nuova_feature2']

individuo_0         True
individuo_1        False
individuo_2        False
individuo_3        False
individuo_4        False
                   ...
individuo_30157    False
individuo_30158    False
individuo_30159    False
individuo_30160    False
individuo_30161     True
Name: nuova_feature2, Length: 30162, dtype: bool

In [53]:
new_dataframe = dataframe.drop(['capital_gain','capital_loss'], axis=1)

In [54]:
categorical_columns = new_dataframe.columns[new_dataframe.dtypes=='object']

for i in categorical_columns:
    new_dataframe[i] = new_dataframe[i].fillna('missing')

In [55]:
new_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
Index: 30162 entries, individuo_0 to individuo_30161
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             30162 non-null  int64
 1   work_class      30162 non-null  object
 2   education       30162 non-null  object
 3   marital_status  30162 non-null  object
 4   occupation      30162 non-null  object
 5   relationship    30162 non-null  object
 6   race            30162 non-null  object
 7   sex             30162 non-null  object
 8   hours_per_week  30162 non-null  int64
 9   native_country  30162 non-null  object
 10  income          30162 non-null  object
 11  nuova_feature1  30162 non-null  int64
 12  nuova_feature2  30162 non-null  bool
dtypes: bool(1), int64(3), object(9)
memory usage: 4.0+ MB

In [56]:
new_dataframe['native_country'].unique()

array(['United-States', 'Other', 'Latin-America', 'British-Commonwealth',
       'Germany', 'Iran', 'SE-Asia', 'Poland', 'South-America', 'China',
       'Portugal', 'France', 'Italy', 'South', 'Japan', 'Yugoslavia',
       'Greece', 'Hungary', 'Holand-Netherlands'], dtype=object)

In [57]:
new_dataframe.to_csv('./output.csv', compression='zip')